#### Terraform Format and Style 🖌 `failure` (ignored)
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.github.github_team.gesasso will be created
  + resource "github_team" "gesasso" {
      + description = "L'outil de gestion des assos au SiMDE"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Gesasso"
      + node_id     = (known after apply)
      + privacy     = "closed"
      + slug        = (known after apply)
    }

  # module.github.module.cesar_richard.github_team_membership.membership["gesasso"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "cesar-richard"
    }

  # module.github.module.noe_amiot.github_team_membership.membership["gesasso"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "noeamiot"
    }

  # module.github.module.old_NastuzziSamy.github_team_membership.membership["gesasso"] must be replaced
-/+ resource "github_team_membership" "membership" {
      ~ etag     = "W/\"9d9950e748f8ce8989b12df3e7a5cd5d832efe5d9e0db564463bc94e77b4f29e\"" -> (known after apply)
      ~ id       = "3158197:NastuzziSamy" -> (known after apply)
      ~ team_id  = "3158197" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.github.module.old_cesar_richard.github_team_membership.membership["gesasso"] must be replaced
-/+ resource "github_team_membership" "membership" {
      ~ etag     = "W/\"0c620fcb365f5cea25b5dd3e6293eef7a496f54572ba3f6c9b2a3d50b759db8f\"" -> (known after apply)
      ~ id       = "3158197:cesar-richard" -> (known after apply)
      ~ team_id  = "3158197" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.github.module.old_loic_jumel.github_team_membership.membership["gesasso"] must be replaced
-/+ resource "github_team_membership" "membership" {
      ~ etag     = "W/\"a65fd60a6e7d0c5fa0b55f3916aa53bcfe0ff32e1fb445114b56f9ce059951d4\"" -> (known after apply)
      ~ id       = "3158197:jumelloic" -> (known after apply)
      ~ team_id  = "3158197" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.github.module.repositories.github_branch_protection.gesasso_mkmail_master will be created
  + resource "github_branch_protection" "gesasso_mkmail_master" {
      + enforce_admins         = false
      + id                     = (known after apply)
      + pattern                = "main"
      + push_restrictions      = [
          + "MDQ6VGVhbTQyMTc3MzM=",
        ]
      + repository_id          = (known after apply)
      + require_signed_commits = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "MDQ6VGVhbTQyMTc3MzM=",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
        }
    }

  # module.github.module.repositories.github_repository.gesasso_mkmail will be created
  + resource "github_repository" "gesasso_mkmail" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Le nécessaire pour les mails"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = true
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "gesasso_mkmail"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.github.module.repositories.github_team_repository.gesasso_gesasso_mkmail will be created
  + resource "github_team_repository" "gesasso_gesasso_mkmail" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "gesasso_mkmail"
      + team_id    = (known after apply)
    }

  # module.github.module.repositories.github_team_repository.simde_gesasso_mkmail will be created
  + resource "github_team_repository" "simde_gesasso_mkmail" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "gesasso_mkmail"
      + team_id    = "4217733"
    }

Plan: 10 to add, 0 to change, 3 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

</details>

*Pusher: @cesar-richard, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI`*